#!/usr/bin/env python
# encoding: utf-8

# -------------------------------------------
# 功能：
# Author: zx
# Software: PyCharm Community Edition
# File: test.py
# Time: 16-12-8 下午2:40
# -------------------------------------------

# 耗时测试
# time_begin = time.time()
# text = "今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族.今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族." \
#        "今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族.今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族." \
#        "今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族.今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族." \
#        "今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族.今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族" \
#        "今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族.今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族" \
#        "今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族.今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族" \
#        "今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族.今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族" \
#        "今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族.今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族" \
#        "今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族.今天的股票涨势挺好.我喜欢苹果.我讨厌小米和魅族"
# text_arr = text.split(".")
# result_list = []
# count = 1
# for t in text_arr:
#     print count, " ", t
#     count += 1
#     result = parser(t)
#     result_list.append(result)
#
# time_end = time.time()
# print "[句子个数] ", len(text_arr)
# print "[结果] ", len(result_list)
# print "[总耗时]", time_end - time_begin
